Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Typically, the timestamp assigner is called right after the source function because most assigners make assumptions about the order of elements with respect to their timestamps when generating watermarks.
zh_cn: 通常情况下，应该在数据源函数后面立即调用时间戳分配器，因为大多数分配器在生成水位线的时候都会做出一些有关元素顺序相对时间戳的假设。

source: Typically, there are multiple TaskManagers running in a Flink setup.
zh_cn: 通常在Flink搭建过程中要启动多个TaskManager。

source: Typically, there are multiple TaskManager running in a Flink setup.
zh_cn: 通常在Flink设置过程中要启动多个TaskManager。

source: Typically, there are two classes of queries executed on a data warehouse.
zh_cn: 通常数据仓库中的查询可以分为两类：

source: Typi‐ cally, these intervals are defined using time-based logic.
zh_cn: 通常情况下，这些区间都是使用时间逻辑定义的。

source: UDFs are written by the application programmer and implement custom computation logic.
zh_cn: UDF由应用开发人员编写，实现某些自定义的计算逻辑。

source: Under Overview you can see how many checkpoints have been trig‐ gered, are in progress, have completed successfully, or have failed.
zh_cn: 在Overview中，你可以查看已触发正在进行中、已经成功完成和已经失败的检查点的数目。

source: Unfortunately, figuring out the memory consumption of RocksDB is not straightforward because it depends on the number of keyed states in an application.
zh_cn: 但遗憾的是它的内存占用量没有什么直观的计算方法，因为具体值取会决于应用中键值分区状态的数量。

source: Unfortunately, the Flink Docker image we used in the Docker and Kubernetes examples before does not support setting custom con‐ figuration parameters.
zh_cn: 很可惜，我们在先前Docker和Kubernetes示例中用到的Flink Docker镜像还不支持自定义配置参数。

source: Unfortunately, there are no standard interfaces for most of these storage systems, except JDBC for relational DBMS.
zh_cn: 然而遗憾的是，除了关系型数据库系统有JDBC外，这些存储系统大都缺乏标准的接口。

source: Union list state
zh_cn: 联合列表状态（union list state）

source: Unique identifiers should be specified for every operator of an application.
zh_cn: 你应该为应用中的每个算子指定唯一标识。

source: Unless you opt for a very conservative watermark strategy that guarantees that all relevant records will be included at the cost of high latency, your application will most likely have to handle late elements.
zh_cn: 除非你选择一种非常保守的水位线生成策略，以高延迟为代价确保涵盖全部相关记录，否则你的应用将很有可能需要处理迟到的元素。

source: Unless you specify a parallelism, a program is executed by as many threads as the number of CPU threads of your development machine.
zh_cn: 除非手工指定并行度，否则程序的线程数会和你开发机器的CPU线程数一样多。

source: Unlike batch applications, which are built around the premise that all data is avail‐ able, the latency/completeness tradeoff is a fundamental characteristic of stream pro‐ cessing applications, which process unbounded data as it arrives.
zh_cn: 对于批处理应用而言，构建的前提是所有数据都处于可用状态。而流处理应用需要应对随时到来的无限数据，因此要在延迟和完整性之间进行取舍是它的一项基本特点。

source: Until Flink 1.7, the only sup‐ ported compression algorithm is Snappy.
zh_cn: 截至1.7版本，内置的压缩算法还只有Snappy。

source: Until the rise of Apache Hadoop, specialized analytical database systems and data warehouses were the predominant solutions for data analytics workloads.
zh_cn: 在Apache Hadoop出现前，专业分析型数据库系统和数据仓库共同占据着数据分析的江山。

source: Until today, more than 470 individuals have contributed to Flink and it has evolved into one of the most sophisticated open source stream processing engines as proven by its widespread adoption.
zh_cn: 时至今日，它已经有超过470名贡献者，并在不断普及的过程中逐渐演变为开源界最为复杂的流处理引擎之一。

source: Up to this point, we have considered streaming concepts independently of Apache Flink.
zh_cn: 到目前为止，我们考虑的流处理相关概念都还是独立于Apache Flink的。

source: Updating Results by Including Late Events
zh_cn: 基于迟到事件更新结果

source: Updating an Application without Modifying Existing State
zh_cn: 保持现有状态更新应用

source: Updating or extending the logic of an application without changing or removing an existing state.
zh_cn: 在不对已有状态进行更改或删除的前提下更新或扩展应用逻辑，

source: Updating the event time of a task with watermarks
zh_cn: 利用水位线更新任务的事件时间

source: Uploads a JAR file to the cluster
zh_cn: 将JAR文件上传到集群

source: Upon receiving a latency marker, all opera‐ tors except sinks forward it downstream.
zh_cn: 在收到延迟标记后，除数据汇以外的所有算子都会将它们转发到下游。

source: Upon the completion of a checkpoint, i.e., when all tasks have successfully written their state into the remote storage, the JobManager writes the state handles to the remote storage and a pointer to this location to ZooKeeper.
zh_cn: 在checkpoint即将完成之际，如果所有任务已经将各自状态成功写入远程存储，JobManager就会将状态句柄写入远程存储，并将远程位置的指针写入ZooKeeper。

source: Use a binary distribution of Flink that was built for a particular Hadoop version.
zh_cn: 使用针对特定Hadoop版本构建的Flink二进制发行版。

source: Use the Hadoop-free distribution of Flink and manually configure the classpath for Hadoop’s dependencies.
zh_cn: 使用不带Hadoop的Flink发行版并为Hadoop依赖手动配置Classpath。

source: User functions can employ keyed state to store and access state in the context of a key attribute.
zh_cn: 用户函数可以使用键值分区状态来存储和访问当前键值上下文中的状态。

source: User-code class loaders are disposed of when the corresponding job terminates.
zh_cn: 用户代码类加载器会在相应的作业结束时销毁。

source: User-defined timestamp assignment functions are usually applied as close to a source operator as possible because it can be very difficult to reason about the order of records and their timestamps after they have been processed by an operator.
zh_cn: 用户自定义的时间戳分配函数通常都会尽可能地靠近数据源算子，因为在经过其他算子处理后，记录顺序和它们的时间戳会变得难以推断。

source: Users are organized in teams and the application collects a team’s activity and provides rewards in the game, such as extra lives and level-ups, based on how fast the team’s members meet the game’s goals.
zh_cn: 该应用将用户组织成不同团队，并会收集每个团队的活动信息，这样就能基于团队成员完成游戏目标的速度，提供诸如额外生命或等级提升的游戏奖励

source: Users have reported applications with state sizes of multiple terabytes leveraging RocksDBStateBackend.
zh_cn: 已经有用户介绍使用RocksDBStateBackend支撑起了状态大小为数个TB的应用。

source: Using Connected Broadcast State
zh_cn: 使用联结的广播状态

source: Using a timestamp assigner
zh_cn: 使用时间戳分配器

source: Using logging in a MapFunction
zh_cn: 在MapFunction中使用日志

source: Using savepoints
zh_cn: 保存点的使用

source: Using task parallelism you can better uti‐ lize the computing resources of a cluster.
zh_cn: 通过任务并行，可以更好地利用集群的计算资源。

source: Using task parallelism, you can better utilize the computing resources of a cluster.
zh_cn: 通过任务并行，可以更好地利用集群的计算资源。

source: Using the CheckpointedFunction Interface
zh_cn: 使用CheckpointedFunction接口

source: Using the DataSet API you can also define iterative Flink programs that exe‐ cute a loop function for a fixed number of steps or until a convergence criterion is met.
zh_cn: 你还可以使用DataSet API定义用于迭代的Flink程序，它们可以以固定次数执行循环函数或直至满足收敛调节。

source: Using the DropwizardHistogramWrapper
zh_cn: 使用DropwizardHistogramWrapper

source: Using the interval join
zh_cn: 使用基于间隔的Join

source: Using these exam‐ ples, we will show how Flink applications are executed and debugged in an IDE.
zh_cn: 这些示例将向你展示如何在IDE中执行和调试Flink应用。

source: Usually the RichSinkFunction interface is used because sink functions typically need to set up a connection to an external system in the RichFunction.open() method.
zh_cn: 通常我们会使用RichSinkFunction抽象类，因为数据汇函数经常需要在RichFunction.open()方法里建立和外部系统的连接。

source: Usually, the master process has moderate memory requirements.
zh_cn: 通常，主进程对于内存的要求并不苛刻，

source: V), contains(key: K), remove(key: K), and iterators over the contained entries, keys, and values.
zh_cn: 以及用于遍历所含条目（entry）、键和值的遍历器。

source: Valid options are:
zh_cn: 可选的配置项有：

source: Value state
zh_cn: 单值状态（value state）

source: ValueState[T] holds a single value of type T. The value can be read using Value State.value() and updated with ValueState.update(value: T).
zh_cn: ValueState[T]用于保存类型为T的单个值。你可以利用ValueState.value()来读取该值并通过ValueState.update(value: T)来更新它。

source: Vasia is a PMC member of the Apache Flink project.
zh_cn: 瓦西里基同样是Apache Flink项目的PMC成员。

source: Vasiliki Kalavri is a postdoctoral fellow in the Systems Group at ETH Zurich, where she uses Apache Flink extensively for streaming systems research and teaching.
zh_cn: 瓦西里基·卡拉夫里是苏黎世联邦理工学院系统组的博士后研究员，平日里会将Apache Flink广泛用于流式系统研究及教学工作。

source: Virtually all data is created as continuous streams of events.
zh_cn: 几乎所有数据都是以连续事件流的形式产生。

source: WAL sink At-most-once
zh_cn: WAL数据汇 至多一次

source: Wait for all in-flight data to be completely processed, meaning all tasks have pro‐ cessed all their input data.
zh_cn: 等待已经流入系统的数据被完全处理，即所有任务已经处理完所有的输入数据。

source: Watermark Propagation and Event Time
zh_cn: 水位线传播和事件时间

source: Watermarks
zh_cn: 水位线

source: Watermarks are a powerful way to control the behavior of an application with respect to time.
zh_cn: 水位线是一种控制应用时间处理行为的强大方法。

source: Watermarks are essential for both event-time win‐ dows and operators handling out-of-order events.
zh_cn: 水位线无论对于事件时间窗口还是处理乱序事件的算子都很关键。

source: Watermarks are essential to both event-time windows and operators handling out-of-order events.
zh_cn: 水位线无论对于事件时间窗口还是处理乱序事件的算子都很关键。

source: Watermarks are related to record timestamps.
zh_cn: 水位线和记录的时间戳紧密相关。

source: Watermarks are used to balance latency and result completeness.
zh_cn: 水位线可用于平衡延迟和结果的完整性。

source: Watermarks are used to derive the current event time at each task in an event-time application.
zh_cn: 水位线用于在事件时间应用中推断每个任务当前的事件时间。

source: Watermarks are used to derive the current event-time at each task in an event-time application.
zh_cn: 水位线用于推断事件时间应用中每个任务当前的事件时间。

source: Watermarks flow in a stream of regular records with annotated timestamps as Figure 3-8 shows.
zh_cn: 如图3-8所示，它像带有注释时间戳的常规记录一样在数据流中移动。

source: Watermarks flow in a stream of regular records with annotated time‐ stamps as Figure 3-8 shows.
zh_cn: 如图3-8所示，它们像带有额外时间戳的常规记录一样在数据流中移动。

source: Watermarks have two basic properties.
zh_cn: 水位线拥有两个基本属性。

source: Watermarks have two basic properties:
zh_cn: 水位线拥有两个基本属性：

source: Watermarks must be monotonically increasing in order to ensure that the event-time clocks of tasks are progressing and not going backwards.
zh_cn: 水位线必须单调递增，这是为了确保任务中的事件时间时钟正确前进，不会倒退。

source: Watermarks provide a configurable trade-off between results confidence and latency.
zh_cn: 水位线允许我们在结果的准确性和延迟之间调整取舍。

source: Watermarks provide a configurable tradeoff between results confidence and latency.
zh_cn: 水位线允许我们在结果的准确性和延迟之间做出取舍。

source: Watermarks that are very tight, i.e., close to the record timestamps, result in low processing latency because a task will only briefly wait for more records to arrive before finalizing a computation.
zh_cn: 如果水位线很紧密（靠近记录时间戳），得到结果的处理延迟就会很低，因为任务无须等待多少记录到来就可以触发最终计算。

source: Watermarks that are very tight—close to the record timestamps—result in low processing latency because a task will only briefly wait for more records to arrive before finalizing a computation.
zh_cn: 如果水位线和记录的时间戳非常接近，那结果的处理延迟就会很低，因为任务无须等待过多记录就可以触发最终计算。

source: Watermarks, Latency, and Completeness
zh_cn: 水位线、延迟及完整性问题

source: Watermarks”, the DataStream API provides two options to assign timestamps and generate watermarks.
zh_cn: DataStream API为分配时间戳和生成水位线提供了两种可选方式。

source: We already discussed some of the features of the Context object when introducing the process functions, such as access to the current processing and event-time and
zh_cn: 在介绍处理函数的时候，我们已经讨论过Context对象的一些功能，例如访问当前处理时间和事件时间，访问副输出等。

source: We also assume per‐ fect failure detectors and that no task will intentionally act maliciously; that is, all non-failed tasks follow the above steps.
zh_cn: 我们还假设任何故障都会被检测到，没有任务故意捣乱。换言之，所有正常运行的任务都会遵循上述步骤。

source: We also assume perfect failure detectors and that no task will intentionally act mali‐ ciously, meaning all nonfailed tasks follow the above steps.
zh_cn: 我们还假设任何故障都会被检测到，没有任务故意捣乱。换言之，所有正常运行的任务都会遵循上面提到的步骤。

source: We also discuss Flink’s unique savepoint feature, a “Swiss Army knife”-like tool that addresses many challenges of operating streaming applications.
zh_cn: 此外我们还会讨论Flink所独有的保存点（savepoint）机制，它就像一把瑞士军刀，解决了运行流式应用中的诸多挑战。

source: We also discuss performance aspects and how to control the size of function
zh_cn: 此外，还将讨论性能方面的问题以及如何控制函数状态的大小。

source: We also discussed the semantics of watermarks, how to trade off result com‐ pleteness and result latency, and strategies for handling late events.
zh_cn: 我们还讨论了水位线的语义，如何在结果的完整性和延迟之间进行取舍，以及处理迟到事件的相关策略。

source: We also looked into supported data types and different ways to specify keys and user-defined functions.
zh_cn: 我们还了解了Flink支持的数据类型以及用于指定键值和用户自定义函数的多种方法。

source: We also provide complete example applications implemented in Java and Scala in our GitHub repositories.
zh_cn: 我们在Github仓库中同时提供了用Java和Scala实现的完整示例程序。

source: We also show how to jointly apply incremental aggregation and full window functions in a window operator.
zh_cn: 此外我们还将展示如何在窗口算子上联合应用增量聚合及全量窗口函数。

source: We are grateful to everyone who has contributed to Flink through code, documentation, reviews, bug reports, feature requests, mailing list discussions, trainings, conference talks, meetup organization, and other activities.
zh_cn: 感谢所有通过代码、文档、评论、Bug报告、功能需求、邮件列表讨论、培训、会议演讲、聚会组织等一切活动为Flink做出过贡献的人。

source: We assume reliable network connections, and that no records are dropped or duplicated and all events are eventually delivered to their destination in FIFO order.
zh_cn: 我们假设网络连接是可靠的，不存在记录丢失或重复，且所有事件最终都会以先进先出的顺序到达各自终点。

source: We assume reliable network connections, such that no records are dropped or duplicated and all events are eventually delivered to their destination in FIFO order.
zh_cn: 我们假设网络连接是可靠的，即不存在记录丢失或重复，所有事件最终都会以先进先出的顺序到达其终点。

source: We assume the following software is installed as well, although it is not strictly required to develop Flink applications:
zh_cn: 此外，虽不必需，但我们假设以下软件也已装好：

source: We briefly explain the main concepts of Kafka before we dive into the details of Flink’s Kafka connector.
zh_cn: 在深入了解Flink的Kafka连接器之前，我们首先来简单介绍一下Kafka的核心概念。

source: We call this type of applications data pipelines.
zh_cn: 我们将此类应用称为数据管道。

source: We can key the input stream by the second and third fields as follows:
zh_cn: 可以像下面这样利用第二、三字段作为输入流的键值：

source: We can parametrize the above example and pass the String "flink" as a parameter to the KeywordFilter constructor as shown below:
zh_cn: 我们为上述示例添加参数并将"flink"字符串以参数形式传给KeywordFilter：

source: We can rewrite the filtering example in the Java DataStream API as follows:
zh_cn: 我们可以像下面这样利用Java DataStream API重写过滤示例：

source: We covered basic streaming operations and how to compute meaningful results on unbounded input data using windows.
zh_cn: 章节还涵盖了基本的流式操作以及如何利用窗口在无限输入上计算出有意义的结果。

source: We define sliding windows by providing their length and their slide.
zh_cn: 我们通过指定长度和滑动间隔来定义滑动窗口。

source: We describe both interfaces in detail next.
zh_cn: 接下来我们详细讨论一下它们。

source: We describe both notions in the fol‐ lowing sections.
zh_cn: 接下来的几节我们来介绍一下它们。

source: We describe how to assign operator identifiers in detail in “Specifying Unique Operator Identifiers” on page 168.
zh_cn: 有关分配算子标识的详细内容会在168页"指定唯一算子标识"中介绍。

source: We describe the classes of applications as distinct patterns to emphasize the versatility of stateful stream processing, but most real-world applications share the properties of more than one class.
zh_cn: 为了突出状态化流处理的用途之多，我们将不同的应用类别区分地很明显，而事实上大多数真实应用都会同时具有多种类别的特性。

source: We describe the classes of applications as distinct patterns to emphasize the versatility of stateful stream processing.
zh_cn: 为了突出状态化流处理的不同用途，我们假设每种应用类别模式单一。

source: We describe the steps for a UNIX environment, but if you are running Windows, we recommend setting up a virtual machine with Linux, Cygwin (a Linux environment for Win‐ dows), or the Windows Subsystem for Linux, introduced with Windows 10.
zh_cn: 我们假设以下步骤都是针对UNIX环境，如果你用Windows，我们建议你配置一个Linux虚拟机，也可以安装Cygwin（一个Windows下的Linux环境）或配置WSL（Windows Subsystem for Linux，Windows 10中新加的功能）。

source: We describe the steps for a UNIX environment.
zh_cn: 我们将以类UNIX环境为例介绍操作步骤。

source: We did not provide a comprehensive configu‐ ration guide; instead, we refer you to the official documentation of Apache Flink for a complete list and detailed descriptions of all configuration options.
zh_cn: 虽然章节中没有提供完整的配置指南，但所有相关内容都可以从Apache Flink官方文档找到，在那里你可以获取完整配置列表以及所有配置项的详细说明。

source: We discuss CoProcessFunction in Chapter 6.
zh_cn: 有关CoProcessFunction的内容会在第6章讨论。

source: We discuss Flink’s fault-tolerance algorithm in Chapter 3.
zh_cn: 我们会在第3章讨论Flink的容错算法。

source: We discuss Flink’s fault-tolerance algorithm in “Checkpoints, Save‐ points, and State Recovery” on page 58.
zh_cn: 我们会在第58页"检查点、保存点和状态恢复"一节讨论Flink的容错算法。

source: We discuss all these matters in this section.
zh_cn: 我们将在本节一一讨论这些问题。

source: We discuss both cases separately.
zh_cn: 我们会分别对二者进行讨论。

source: We discuss how a stream processor can provide accurate results with out-of-order events and how you can perform historical event processing and time travel with streaming.
zh_cn: 我们将讨论流处理引擎如何基于乱序事件产生精确结果，以及如何使用数据流进行历史事件处理及"时间旅行"。

source: We discuss in Chapter 10 how to control the scheduling of tasks.
zh_cn: 我们将在第10章讨论如何控制任务调度。

source: We discuss in “Tuning Checkpointing and Recovery” on page 263 how to use and configure state backends in your application.
zh_cn: 我们会在第263页"调整检查点及恢复"一节讨论具体如何在应用中使用和配置状态后端。

source: We discuss the consistency guarantees of a WAL sink in more detail in “GenericWriteAheadSink”.
zh_cn: 我们会在"GenericWriteAheadSink"一节更详细地讨论WAL数据汇的一致性保障。

source: We discuss the details of this interface later in this section.
zh_cn: 我们会在本章后面讨论此接口的详情。

source: We discuss the implementation of a user-defined function in a later sec‐ tion of this chapter.
zh_cn: 有关用户自定义函数的实现会在本章后面部分讨论。

source: We discuss the importance of unique operator identifiers and the mapping of savepoint state in more detail in “Savepoints” on page 66.
zh_cn: 有关唯一算子标识的重要性及保存点状态的映射规则已经在第66页"保存点"一节详细讨论过了。

source: We discuss the responsibilities of each component and how it interacts with the other components in the following.
zh_cn: 我们接下来讨论各组件的职责以及它们之间是如何交互的。

source: We discuss the semantics of all operators available in Flink in Chapter 5.
zh_cn: 我们将在第5章讨论Flink中各算子的语义。

source: We discuss the topic of application deployment in more detail in Chap‐ ter 10.
zh_cn: 我们会在第10章节详细讨论应用部署的相关内容。

source: We discuss these options in more detail in “Tuning Checkpointing and Recovery” on page 263.
zh_cn: 我们会在第263页"调整检查点和恢复"一节详细讨论这些选项。

source: We discuss this difference later in this chapter.
zh_cn: 详细内容将在本章稍后讨论。

source: We discuss this function in detail in “Assigning Timestamps and Generating Watermarks” as well.
zh_cn: 我们同样会在"分配时间戳和生成水位线"一节详细讨论它。

source: We discussed Flink’s strategies to scale stateful operators earlier in this section.
zh_cn: 我们已经在本章前面讨论过Flink对于状态化算子的扩缩容策略。

source: We dis‐ cuss the topic of application deployment in more detail in “Running and Managing Streaming Applications” on page 245.
zh_cn: 我们会在245页的"运行和管理流式应用"一节详细讨论应用部署的相关内容。

source: We dis‐ cussed how open source stream processing systems have evolved since their inception in the early 2010s and how stream processing became a viable solution for many use cases of today’s businesses.
zh_cn: 我们讨论了开源流处理系统如何从二十世纪初逐步进化，成为针对目前很多企业用例的可行解决方案。

source: We don't use processing time timers
zh_cn: 我们不使用处理时间计时器

source: We encourage you to become an active part of its community.
zh_cn: 最后，欢迎加入社区，为项目添砖加瓦！

source: We examined the structure of Flink programs and learned how to combine data and partitioning trans‐ formations to build streaming applications.
zh_cn: 我们研究了Flink程序的结构，学习了如何将数据和分区转换结合来构建流式应用。

source: We explain Flink setups for dif‐ ferent Hadoop versions and filesystems and discuss the most important configuration parameters of Flink’s master and worker processes.
zh_cn: 我们将介绍基于不同Hadoop版本和文件系统的Flink搭建过程，并讨论Flink主进程及工作进程最为重要的配置参数。

source: We explain how state is stored and maintained by state backends and how stateful applications can be scaled by redistributing state.
zh_cn: 我们将解释如何利用状态后端（state backend）对状态进行存储和维护，以及状态化应用如何通过状态再分配实现扩缩容。

source: We explain their semantics and show code examples.
zh_cn: 我们将结合代码示例对它们的语义进行解释。

source: We explained how to add connector dependen‐ cies in “Including External and Flink Dependencies” on page 107.
zh_cn: 我们已经在第107页"导入外部和Flink依赖"中介绍了如何添加连接器依赖。

source: We explained how to configure the time characteristics of a streaming applica‐ tion and how to assign timestamps and watermarks.
zh_cn: 我们解释了如何为流式应用配置时间特征以及如何分配时间戳和水位线。

source: We explained how to enable support for various filesystems and how to integrate them with Hadoop and its components.
zh_cn: 随后我们解释了如何支持多种文件系统以及如何与Hadoop及其组件进行集成。

source: We explained the Flink component that collects and exposes system and application metrics, how to configure a logging system, and how to start, stop, resume, and rescale applications with the command-line client and the REST API.
zh_cn: 我们介绍了用于收集和公开系统及应用指标的Flink组件，还向你展示了如何配置日志系统，如何使用命令行客户端和REST API来启动、停止、恢复应用和对其进行扩缩容。

source: We express these performance requirements in terms of latency and throughput.
zh_cn: 我们用延迟和吞吐来表示这两方面的性能需求。

source: We first show the keyBy() case:
zh_cn: 我们首先来看一下keyBy()的情况：

source: We have to point out that Flink’s checkpointing and recovery mechanism only resets the internal state of a streaming application.
zh_cn: 我们必须指出，Flink的检查点和恢复机制仅能重置流式应用内部的状态。

source: We hope that after reading this chapter, you will be able to evaluate the features of modern stream processing systems.
zh_cn: 希望阅读过后，你能对时下不同流处理系统的功能进行评估。

source: We hope that after reading this chapter, you will have gained a better understanding of stream applications requirements and you will be able to evaluate the features of modern stream processing systems.
zh_cn: 我们希望你在读完本章后能对流处理应用的需求有一个更深刻的理解并可以对当下不同的流处理系统进行功能评估。

source: We know of a company that decided to built the backend of a social network based on an event log and event-driven applications because of these features.
zh_cn: 据我们所知，正是因为上述功能，有公司决定基于事件日志和事件驱动型应用来构建社交网络后端。

source: We list some of these configuration options and their default val‐ ues in Table 10-17.
zh_cn: 我们在表10-17中列出了一些配置选项和它们的默认值。

source: We looked at the dataflow programming model and learned how streaming applications can be expressed as distributed dataflow graphs.
zh_cn: 我们介绍了Dataflow编程模型以及如何将一个流式应用表示为分布式Dataflow图。

source: We need to specify the key by calling keyBy() on the input stream before we apply the function.
zh_cn: 即在应用函数之前需要在输入流上调用keyBy()方法来指定键值。

source: We now look at these parts in detail.
zh_cn: 接下来我们详细介绍一下这些步骤。

source: We now turn to another extremely important aspect of stream processing—state.
zh_cn: 我们现在要转向流处理中另一个十分重要的方面——状态。

source: We now turn to examine another extremely important aspect of stream processing, state.
zh_cn: 我们现在要转而研究流处理中另一个十分重要的方面——状态。

source: We present the transformations of the DataStream API in four categories:
zh_cn: 我们将DataStream API的转换分为四类：

source: We present two different styles of deploying Flink applications and dis‐ cuss how tasks are distributed and executed.
zh_cn: 随后，我们会给出部署Flink应用的两种类型，并讨论如何分配和执行任务。

source: We presented Flink’s most commonly used built-in source and sink connectors, which also serve as representatives for dif‐ ferent types of storage systems, such as message queues, filesystems, and key-value stores.
zh_cn: 我们介绍了Flink中最为常用的内置数据源及数据汇连接器。事实上，它们还分别代表了不同类型的存储系统，例如消息队列、文件系统及键值存储。

source: We pre‐ sented the mode of operation and internals of Flink’s HA setup in more detail in “Highly Available Setup” on page 42.
zh_cn: 有关操作模式及Flink HA设置的内部原理已经在第42页"高可用性设置"中详细介绍过。

source: We recommend setting up Minikube if you would like to try to run Flink on Kubernetes and do not have a Kubernetes cluster at hand.
zh_cn: 如果你想尝试在Kubernetes上运行Flink但手头没有Kubernetes集群，我们建议你搭建一个Minikube。

source: We recommend using IntelliJ IDEA.
zh_cn: 本书建议使用IntelliJ IDEA。

source: We refer you to Apache Flink’s documentation for details.
zh_cn: 详细信息请参阅Apache Flink的官方文档。

source: We refer you to Flink’s documentation and the logback manual for details on how to set up and configure the backend.
zh_cn: 有关如何搭建和配置logback后端的详细信息，请参阅Flink文档和logback用户手册。

source: We refer you to the Kafka documentation for details about its con‐ figuration parameters and guidelines for a suitable configuration.
zh_cn: 我们建议你参阅Kafka文档来详细了解有关配置属性的信息以及配置指南。
